In [2]:
import pandas as pd
d=pd.read_csv('./c/core1.csv',low_memory=False)
d.head()

   id   num
0   1  1451
1   2  2563
2   3  2202
3   4   474
4   5  1017

In [3]:
a = d['id'].tolist()

In [126]:
import pandas as pd
d_2=pd.read_csv('./146293-4km.csv',low_memory=False)
d_2.head()

    id   dis_a_b
0   17  2.287715
1   47  3.923627
2   91  2.772396
3   95  1.593156
4  212  2.902639

In [127]:
b = d_2['id'].tolist()

In [128]:
retD = list(set(a).difference(set(b)))

In [129]:
#组成核心1节点4Km外的点集合
import pandas as pd
from pandas import DataFrame
node = { "id" : retD} #将列表a，b转换成字典
h_2_1 = DataFrame(node) #将字典转换成为数据框
h_2_1[['id']].to_csv('./data/c4wai.csv',index = None,header = True,sep = ',' , encoding='utf-8')
print(h_2_1.head())

   id
0   1
1   2
2   3
3   4
4   5

In [130]:
#左链接所有节点距离
import pandas as pd
d_2_2=pd.read_csv('./data/4_c/company_1-30.csv',low_memory=False)
d_2_2.head()

   id   num
0   1  1451
1   2  2563
2   3  2202
3   4   474
4   5  1017

In [131]:
rore2 = pd.merge(h_2_1, d_2_2, on='id', how='left')

In [121]:
rore2.head()

   id   num
0   1  1451
1   2  2563
2   3  2202
3   4   474
4   5  1017

In [132]:
rore2[['id','num',]].to_csv('./data/ccore5.csv',index = None,header = True,sep = ',' , encoding='utf-8')
print(1)

1